{
  "backend/main.mo": "Motoko backend defining products, categories, orders, user profiles, and admin‑restricted catalog/order operations with access‑control mixin.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference in build planning.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables and dark mode overrides.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App router setup with all public and admin routes wrapped in AppLayout and CartProvider.",
  "frontend/src/components/admin/AdminGate.tsx": "Restricts admin routes by checking identity, admin status, and profile completion before rendering children.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, navigation, mobile menu, cart badge, and footer around page content.",
  "frontend/src/components/auth/LoginButton.tsx": "Button that triggers Internet Identity login/logout and updates query cache accordingly.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting admins to enter their name and save a new user profile.",
  "frontend/src/components/OrderStatusBadge.tsx": "Badge component that displays payment status using styled variants for pending, paid, or failed.",
  "frontend/src/components/PaymentMethodSelector.tsx": "UI component for selecting cash-on-delivery or UPI payment and capturing UPI reference input.",
  "frontend/src/components/ProductCard.tsx": "Displays product info with image, price, stock badge, and navigation to product details.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context for authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for categories, products, orders, and user profiles using the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "Initializes React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCatalogPage.tsx": "Admin interface for managing categories and products, including creation, editing, and seeding demo data.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows admin overview with product and order counts plus navigation to catalog and order management.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page listing all orders, showing details, and allowing payment status updates.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, allowing quantity updates, item removal, and navigation to products or checkout.",
  "frontend/src/pages/CategoriesPage.tsx": "Fetches and displays product categories with loading skeletons and navigation to category product lists.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout form, validation, payment selection, and order placement before redirecting to confirmation.",
  "frontend/src/pages/HomePage.tsx": "Displays hero section, feature highlights, and a featured products list on the store homepage.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows confirmation details for a placed order and provides options to track the order or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays product details, handles quantity selection, and adds items to the cart with loading and missing-product states.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products or category-filtered products with loading states and category navigation.",
  "frontend/src/pages/TrackOrderPage.tsx": "Allows users to enter an order ID and phone number to fetch and display order status and details.",
  "frontend/src/state/cartStore.tsx": "Provides a React context for cart state with add, remove, update, clear, and total-price functions, persisting items in localStorage with BigInt handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL params (including hash routing), store/retrieve them in sessionStorage, and manage persisted parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration customizing colors, typography, animations, and plugins for the project's UI theme.",
  "project_state.json": "Project metadata describing requirements, features, versions, and image needs for the Jubaan Hit Masala storefront app."
}